# Pandas

This notebook contains some of useful operations of Pandas with focus on DataFrames and data wrangling.

In [38]:
import pandas as pd

Pandas has two main data structures:
1. Series
2. DataFrames

## Pandas Series

In [39]:
a = pd.Series(data = ['a','b','c','d'], index = ['index0', 'index1', 'index2','index3'])
# Note that Data must be homogenous

In [40]:
print(a)
type(a)

index0    a
index1    b
index2    c
index3    d
dtype: object

pandas.core.series.Series

#### Indexing and Slicing on Series

In [41]:
# Grab the index2 value
a[2]

'c'

In [42]:
# Grab values from index1 to index2
a[1:3]

index1    b
index2    c
dtype: object

## Pandas DataFrames

Although, we rarely would be instantiating our own DataFrames and instead would be importing data from csv file. But lets do one.

In [43]:
df = pd.DataFrame(data = [['1','John',20],['2','Kelly',10],['3','Brad',12],['4','Sally',8]], index = ['index0', 'index1', 'index2','index3'], columns=['Customer ID','Name', 'Payment'])
df

       Customer ID   Name  Payment
index0           1   John       20
index1           2  Kelly       10
index2           3   Brad       12
index3           4  Sally        8

### Reading a CSV file

Almost always we would import data from csv, excel, web or other source.

In [54]:
# Salaries dataFrame
df = pd.read_csv('Salaries.csv')
df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

### Explore this Data Set

In [45]:
print(df.shape)  # To check the dimension
print(df.info()) # Overall Information of the dataFrame

(148654, 13)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
Id                  148654 non-null int64
EmployeeName        148654 non-null object
JobTitle            148654 non-null object
BasePay             148045 non-null float64
OvertimePay         148650 non-null float64
OtherPay            148650 non-null float64
Benefits            112491 non-null float64
TotalPay            148654 non-null float64
TotalPayBenefits    148654 non-null float64
Year                148654 non-null int64
Notes               0 non-null float64
Agency              148654 non-null object
Status              0 non-null float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB
None

### Checking statistics on a particular column

In [48]:
df['BasePay'].describe()
# This will give summary statistics on numerical column i-e 'BasePay'

count    148045.000000
mean      66325.448841
std       42764.635495
min        -166.010000
25%       33588.200000
50%       65007.450000
75%       94691.050000
max      319275.010000
Name: BasePay, dtype: float64

### Changing the Index

In [49]:
df.head(2)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN

In [50]:
#Lets say we want Id column to be our Index
df.set_index('Id', inplace=False).head(2) 
# I do not want a permanent change, inplace=False

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
Id,,,,,,,,,,,,
1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN

### Adding a Column

In [55]:
df['new_col'] = df['BasePay'] + df['OvertimePay']

In [56]:
df.head(1)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status,new_col
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN,167411.18

### Removing a Column

In [57]:
df.head(1)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status,new_col
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN,167411.18

In [58]:
#Lets say we want to drop OvertimePay
df.drop(columns=['new_col'], axis=1 ,inplace=True)

In [59]:
df.head(1)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

### loc and iloc

###### Use iloc when you refer index and columns by their respective numbers indexes.
###### Use loc when you refer index and columns by their respective names or values.

In [46]:
df.head(1)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

###### Get DataFrame from index:10 to 13 with columns starting from Id to Benefits and use iloc

In [63]:
df.iloc[10:14,0:7 ]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits
10,11,ARTHUR KENNEY,"ASSISTANT CHIEF OF DEPARTMENT, (FIRE DEPARTMENT)",194999.39,71344.88,33149.90,NaN
11,12,PATRICIA JACKSON,CAPTAIN III (POLICE DEPARTMENT),99722.00,87082.62,110804.30,NaN
12,13,EDWARD HARRINGTON,EXECUTIVE CONTRACT EMPLOYEE,294580.02,0.00,0.00,NaN
13,14,JOHN MARTIN,DEPARTMENT HEAD V,271329.03,0.00,21342.59,NaN

###### Get DataFrame from index:10 to 13 with columns starting from Id to Benefits and use loc

In [65]:
df.loc[10:13,'Id':'Benefits' ]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits
10,11,ARTHUR KENNEY,"ASSISTANT CHIEF OF DEPARTMENT, (FIRE DEPARTMENT)",194999.39,71344.88,33149.90,NaN
11,12,PATRICIA JACKSON,CAPTAIN III (POLICE DEPARTMENT),99722.00,87082.62,110804.30,NaN
12,13,EDWARD HARRINGTON,EXECUTIVE CONTRACT EMPLOYEE,294580.02,0.00,0.00,NaN
13,14,JOHN MARTIN,DEPARTMENT HEAD V,271329.03,0.00,21342.59,NaN

Notice in .loc, the end is exclusive unlike .iloc. But the main distinction loc uses names or values, iloc uses numbers indexing

#### Selecting some rows and columns

Select Row 10 and 20 with EmployeeName and BasePay

In [66]:
# .loc would be appropriate to use
df.loc[[10,20],['EmployeeName' , 'BasePay']]

     EmployeeName    BasePay
10  ARTHUR KENNEY  194999.39
20     VENUS AZAR  257510.48

In [67]:
# .loc can also be used though
df.iloc[[10,20],[1 , 3]]

     EmployeeName    BasePay
10  ARTHUR KENNEY  194999.39
20     VENUS AZAR  257510.48

Hope this clears iloc and loc.

In [69]:
df.head(1)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

### Refering Column/s

In [113]:
df.loc[:,['Id']].head(2)  # Refering to the 'Id' Column

   Id
0   1
1   2

A better approach would be:

In [116]:
df[['Id']].head(2)

   Id
0   1
1   2

For multiple columns use this:

In [124]:
df[['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay']].head(2)

,EmployeeName,JobTitle,BasePay,OvertimePay
0,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00
1,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88

### Conditional Selection

If you apply conditional on dataFrame it will return a dataFrame of booleans.

In [148]:
(df>0).head(2)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,True,True,True,True,False,True,False,True,True,True,False,True,False
1,True,True,True,True,True,True,False,True,True,True,False,True,False

In [154]:
(df['BasePay'] >= 315000).head(2) # List is long

0    False
1    False
Name: BasePay, dtype: bool

A useful case is to provide the conditional inside the df[ ] structure to get the rows where the conditonal is true.

Lets say I want the details for those who have 'BasePay'>315000

In [153]:
df[df['BasePay'] >= 315000]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
72925,72926,Gregory P Suhr,Chief of Police,319275.01,0.00,20007.06,86533.21,339282.07,425815.28,2013,NaN,San Francisco,NaN
72929,72930,Robert L Shaw,"Dep Dir for Investments, Ret",315572.01,0.00,0.00,82849.66,315572.01,398421.67,2013,NaN,San Francisco,NaN
110532,110533,Amy P Hart,Asst Med Examiner,318835.49,10712.95,60563.54,89540.23,390111.98,479652.21,2014,NaN,San Francisco,NaN

Or more specifically I want the EmployeeName, JobTitle, BasePay for those having 'BasePay' > 315000

In [60]:
df[df['BasePay'] >= 315000][['EmployeeName', 'JobTitle', 'BasePay']]

          EmployeeName                      JobTitle    BasePay
72925   Gregory P Suhr               Chief of Police  319275.01
72929    Robert L Shaw  Dep Dir for Investments, Ret  315572.01
110532      Amy P Hart             Asst Med Examiner  318835.49

# Lets see some hard ones..!

** What is the highest amount of OvertimePay in the dataset ? **

In [62]:
df['OvertimePay'].max()

245131.88

** What is the job title of  JOSEPH DRISCOLL ? Note: Use all caps, otherwise you may get an answer that doesn't match up (there is also a lowercase Joseph Driscoll). **

In [64]:
df[df['EmployeeName'] == 'JOSEPH DRISCOLL'][['JobTitle']]

                     JobTitle
24  CAPTAIN, FIRE SUPPRESSION

** How much does JOSEPH DRISCOLL make (including benefits)? **

In [65]:
df[df['EmployeeName'] == 'JOSEPH DRISCOLL'][['TotalPayBenefits']]

    TotalPayBenefits
24         270324.91

** What is the name of highest paid person (including benefits)?**

In [68]:
df[df['TotalPayBenefits'] == df['TotalPayBenefits'].max()][['EmployeeName']]

     EmployeeName
0  NATHANIEL FORD

** What was the average (mean) BasePay of all employees per year? (2011-2014) ? **

In [75]:
df.groupby('Year').mean()[['BasePay']]
# This one was interesting

           BasePay
Year
2011  63595.956517
2012  65436.406857
2013  69630.030216
2014  66564.421924

** How many unique job titles are there? **

In [77]:
df['JobTitle'].nunique()

2159

In [78]:
** What are the top 5 most common jobs? **

SyntaxError: invalid syntax (<ipython-input-78-050fa3801a41>, line 1)

In [84]:
df['JobTitle'].value_counts().head(5)

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

For multiple conditions use & for and, | for or.

As an example, lets find details where Id > 110000 and BasePay > 315000

In [163]:
df[(df['Id'] > 110000) & (df['BasePay'] > 315000)]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
110532,110533,Amy P Hart,Asst Med Examiner,318835.49,10712.95,60563.54,89540.23,390111.98,479652.21,2014,NaN,San Francisco,NaN

### Dealing With Missing Values NaN

In [165]:
import numpy as np

In [168]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

Drop a row with any NaN value

In [169]:
df.dropna(axis=0,inplace=False)
# Not a permanent change

     A    B  C
0  1.0  5.0  1

Drop a column with any NaN value

In [172]:
df.dropna(axis=1,inplace=False)
# Not a permanent change

   C
0  1
1  2
2  3

There is a threshold parameter of dropna which you can explore on your own.

### Filling missing values of columns

Alot of times the real data sets have some values missing and we want to fill them using some statistics. One common approach would be to fill the missing values with the average of the column.

In [174]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

Lets fill index 2 of column A with the mean of column A.

In [178]:
df[['A']].fillna(value= df['A'].mean())

     A
0  1.0
1  2.0
2  1.5

In [180]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

### Groupby

Groupby allows to make a group of catagorical column and then call some sort of aggregate method on it. Such as sum, std, etc.
This concept is originated from SQL databases.

In [182]:
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

lets find the company aggregate sales.

In [196]:
df.groupby('Company').sum()
# Pandas will ignore non-numeric column

         Sales
Company
FB         593
GOOG       320
MSFT       464

lets say we need only FB row

In [197]:
df.groupby('Company').sum().loc[['FB']]

         Sales
Company
FB         593

Counting the instances for a catagorical column.

In [198]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

describe( ) method is also very useful.

In [200]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

### Merging, Joining and Concatenating

### Concatination

Concatination GLUES dataFrames together.

In [213]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [214]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [215]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [216]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [219]:
pd.concat([df1,df2,df3], axis=0) 
# Glue these rows together

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [220]:
pd.concat([df1,df2,df3], axis=1) 
# Glue these columns together

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [8]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [9]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [10]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

### Merging

The **merge** function allows you to merge DataFrames together using a similar logic as merging SQL Tables together. For example:

In [12]:
pd.merge(left,right,how='inner',on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [13]:
pd.merge(left,right,how='outer',on=['key1','key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

### Joining

Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

In [14]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [15]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [16]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [18]:
left.join(right, how='inner')
# Only those rows where there is complete match.

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

In [20]:
left.join(right, how='left')
# The the rows of left dataFrames will be present.

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

### Operations and Methods

In [21]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

### Unique Values

In [23]:
df['col2'].unique()
# return array of unique items

array([444, 555, 666])

In [24]:
df['col2'].nunique()
# return the number of unique items

3

In [27]:
df['col2'].value_counts()
# How many times each value occured?

444    2
555    1
666    1
Name: col2, dtype: int64

### Applying Functions

In [28]:
df['col4'] = df['col2'].apply(lambda x: 2*x)

In [30]:
df

   col1  col2 col3  col4
0     1   444  abc   888
1     2   555  def  1110
2     3   666  ghi  1332
3     4   444  xyz   888

### Columns Names and Indexes

In [32]:
df.columns

Index(['col1', 'col2', 'col3', 'col4'], dtype='object')

In [33]:
df.index

RangeIndex(start=0, stop=4, step=1)

### Sort

In [37]:
df.sort_values(by= 'col2', ascending=False)
# sort the dataFrame by 'col2' in descending order

   col1  col2 col3  col4
2     3   666  ghi  1332
1     2   555  def  1110
0     1   444  abc   888
3     4   444  xyz   888

### Concatentation

In [ ]:
Conca

In [201]:
d1 =pd.DataFrame(data=[['a',1],['b',2]] ,columns=['col1','number'])
d1

  col1  number
0    a       1
1    b       2

In [202]:
d2 = pd.DataFrame(data=[['c',3,'lion'],['d',4,'tiger']] ,columns=['letter','number','animal'])
d2

  letter  number animal
0      c       3   lion
1      d       4  tiger

In [205]:
pd.concat(objs=[d1,d2], axis=0)

/Users/Usman93/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

  animal col1 letter  number
0    NaN    a    NaN       1
1    NaN    b    NaN       2
0   lion  NaN      c       3
1  tiger  NaN      d       4